/*
1. Реализовать функцию для вычисления суммы элементов одномерного массива.
2. Реализовать функцию поэлементного умножения значений двух массивов (результат записать в третий массив, передаваемый в функцию).
3. Реализовать функцию для вычисления длины вектора.
4. Реализовать функцию для вычисления косинусного сходства двух векторов одинаковой длины (для реализации применять функции из заданий 1, 2 и 3).
*/

#include <iostream>
#include "defs.h"

using namespace std;

int main() {

    setlocale(LC_ALL, "Rus");

    //system("pause");
    return 0;
}
